### Pandas
##### Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures:
- ``` DataFrames --> DF is two dimensional, size-mmutable, and potentially heterogenous tabular data structure with labeled axes(rows and columns)```
- ``` Series     --> A series is a one-dimenstional array-like object that can hold any data type. It is similar to one column in a table```

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\venka\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\venka\anaconda3\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\venka\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\venka\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\venka\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\venka\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
pwd

'C:\\Users\\venka\\agentic-ai'

In [4]:
import pandas as pd

In [7]:
# Create series 

data = [1,2,3,4,5]
series=pd.Series(data)
print(series)
type(series)
# the first column is Index

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [8]:
# Create series from dictionary

data ={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

# key become index if we use dict for series

a    1
b    2
c    3
dtype: int64

In [9]:
data=[10,20,30]
index=['x','y','z']
pd.Series(data,index=index)

x    10
y    20
z    30
dtype: int64

In [10]:
# Create a basic DataFrame from a dict of list

data={
    'Name':['Venkat','Arjun','Jack'],
    'Age':[25,35,45],
    'City':['NYC','SFO','LA']

}

In [12]:
df=pd.DataFrame(data)
print(df)

     Name  Age City
0  Venkat   25  NYC
1   Arjun   35  SFO
2    Jack   45   LA

In [16]:
# create a DF from a list of dictionaries

data = [

    {'Name':'Venkat','Age':40,'City':'NYC'},
    {'Name':'Peter','Age':45,'City':'NYC'},
    {'Name':'Jack','Age':35,'City':'SFO'},
    {'Name':'Arjun','Age':10,'City':'LA'}
]

df=pd.DataFrame(data)
print(df)

     Name  Age City
0  Venkat   40  NYC
1   Peter   45  NYC
2    Jack   35  SFO
3   Arjun   10   LA

In [15]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
import pandas as pd
df=pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [6]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [9]:
# Accessing data from DataFrame 

df['Product Name']

0                                        iPhone 14 Pro
1                                     Dyson V11 Vacuum
2                                     Levi's 501 Jeans
3                                    The Da Vinci Code
4                              Neutrogena Skincare Set
                            ...
235    Nespresso Vertuo Next Coffee and Espresso Maker
236                          Nike Air Force 1 Sneakers
237             The Handmaid's Tale by Margaret Atwood
238               Sunday Riley Luna Sleeping Night Oil
239                         Yeti Rambler 20 oz Tumbler
Name: Product Name, Length: 240, dtype: object

In [18]:
df['Total Revenue']

0      1999.98
1       499.99
2       209.97
3        63.96
4        89.99
        ...
235     159.99
236     270.00
237      32.97
238      55.00
239      59.98
Name: Total Revenue, Length: 240, dtype: float64

In [19]:
df['Product Category']

0          Electronics
1      Home Appliances
2             Clothing
3                Books
4      Beauty Products
            ...
235    Home Appliances
236           Clothing
237              Books
238    Beauty Products
239             Sports
Name: Product Category, Length: 240, dtype: object

In [20]:
# Create another dataframe using "data"

data={
    'Name':['Venkat','Arjun','Jack'],
    'Age':[25,35,45],
    'City':['NYC','SFO','LA']

}  

df=pd.DataFrame(data)
print(df)

     Name  Age City
0  Venkat   25  NYC
1   Arjun   35  SFO
2    Jack   45   LA

In [22]:
# This is for row index 

df.loc[0]

Name    Venkat
Age         25
City       NYC
Name: 0, dtype: object

In [23]:
# Index location 

df.iloc[0]

Name    Venkat
Age         25
City       NYC
Name: 0, dtype: object

In [25]:
df.iloc[0][2]

C:\Users\venka\AppData\Local\Temp\ipykernel_20248\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'NYC'

In [26]:
df.loc[0][2]

C:\Users\venka\AppData\Local\Temp\ipykernel_20248\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'NYC'

In [27]:
df.describe()

        Age
count   3.0
mean   35.0
std    10.0
min    25.0
25%    30.0
50%    35.0
75%    40.0
max    45.0

In [30]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [31]:
df.columns.tolist()

['Name', 'Age', 'City']

In [32]:
# When we need only columns, just use column name directly inside df
df['Name']

0    Venkat
1     Arjun
2      Jack
Name: Name, dtype: object

In [33]:
# Accessing a pecified element 

df

     Name  Age City
0  Venkat   25  NYC
1   Arjun   35  SFO
2    Jack   45   LA

In [39]:
df.at[1,'Age']

np.int64(35)

In [40]:
# Just want 35...cast into "int()"

int(df.at[1,'Age'])

35

In [42]:
# Accessing specified element using "iat" 

df.iat[2,2]

'LA'

In [43]:
df.iat[0,0]

'Venkat'

In [44]:
# Data manipulation with DataFrames 
# adding a new column 'Salary'

df['Salary']=[50000,60000,70000]

In [45]:
df

     Name  Age City  Salary
0  Venkat   25  NYC   50000
1   Arjun   35  SFO   60000
2    Jack   45   LA   70000

In [46]:
# Remove a column

df.drop('Salary')

KeyError: "['Salary'] not found in axis"

In [47]:
# default axis is "0" means row index. There is no Salary in row index. You have to check in Column index with "1"

df

     Name  Age City  Salary
0  Venkat   25  NYC   50000
1   Arjun   35  SFO   60000
2    Jack   45   LA   70000

In [48]:
df.drop('Salary',axis=1)

     Name  Age City
0  Venkat   25  NYC
1   Arjun   35  SFO
2    Jack   45   LA

In [49]:
df # drop is not permanent operation. Have to use "inplace=True" tag to make it permanent

     Name  Age City  Salary
0  Venkat   25  NYC   50000
1   Arjun   35  SFO   60000
2    Jack   45   LA   70000

In [50]:
# This permanently delete from DF

df.drop('Salary',axis=1,inplace=True)

In [51]:
df

     Name  Age City
0  Venkat   25  NYC
1   Arjun   35  SFO
2    Jack   45   LA

In [54]:
# Increase 1 year to Age column 

df['Age']=df['Age']+1
df

     Name  Age City
0  Venkat   27  NYC
1   Arjun   37  SFO
2    Jack   47   LA

In [55]:
df.drop(0)

    Name  Age City
1  Arjun   37  SFO
2   Jack   47   LA

In [60]:
#df.dtypes

In [59]:
#df.describe()

In [76]:
import pandas as pd
from io import StringIO

# Either put this json with ''' ''' or put it in one line 
data= {"user_id": 1024,"full_name": "Venkat","email": "venkat@example.com"}
pd.read_json(StringIO(data))

TypeError: initial_value must be str or None, not dict

In [71]:
df = pd.DataFrame([data])
print(df)

                                                   0
0  {"user_id": 1024,"full_name": "Venkat","email"...

In [77]:
# Use with json_str  or use dataframe directly since it is a dict (next cell)

import pandas as pd
import json
from io import StringIO

data = {
    "user_id": 1024,
    "full_name": "Venkat",
    "email": "venkat@example.com"
}

json_str = json.dumps(data)

s = pd.read_json(StringIO(json_str), typ='series')
print(s)

user_id                    1024
full_name                Venkat
email        venkat@example.com
dtype: object

In [80]:
df = pd.DataFrame([data])
print(df)

   user_id full_name               email
0     1024    Venkat  venkat@example.com

In [83]:
# creating a dataframe since it is already dict

mydata= {"user_id": 1234,"full_name": "Peter","email": "peter@example.com"}

df=pd.DataFrame([mydata])
df

   user_id full_name              email
0     1234     Peter  peter@example.com

In [85]:
# Converting df to JSON again (observe index (0) with key & values)

df.to_json()

'{"user_id":{"0":1234},"full_name":{"0":"Peter"},"email":{"0":"peter@example.com"}}'

In [86]:
df.to_json(orient='index')

'{"0":{"user_id":1234,"full_name":"Peter","email":"peter@example.com"}}'

In [87]:
df.to_json(orient='records')

'[{"user_id":1234,"full_name":"Peter","email":"peter@example.com"}]'

In [104]:
csv_df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [105]:
csv_df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [106]:
# CONVERTING TO CSV (wine.csv)

csv_df.to_csv("wine.csv")

In [107]:
url="https://www.fdic.gov/bank/individual/failed/banklist.html"

web_df=pd.read_html(url)

In [109]:
web_df

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [128]:
!pip install lxml
!pip install html5lib
!pip install beautifulsoup4
%pip install requests

Requirement already satisfied: lxml in c:\users\venka\anaconda3\lib\site-packages (5.3.0)
Requirement already satisfied: html5lib in c:\users\venka\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\venka\anaconda3\lib\site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in c:\users\venka\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: beautifulsoup4 in c:\users\venka\anaconda3\lib\site-packages (4.13.5)
Requirement already satisfied: soupsieve>1.2 in c:\users\venka\anaconda3\lib\site-packages (from beautifulsoup4) (2.5)
Requirement already satisfied: typing-extensions>=4.0.0 in c:\users\venka\anaconda3\lib\site-packages (from beautifulsoup4) (4.15.0)
Requirement already satisfied: requests in c:\users\venka\anaconda3\lib\site-packages (2.32.5)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\venka\anaconda3\lib\site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\venka\anaconda3\lib\site-packages (from requests) (3.11)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\venka\anaconda3\lib\site-packages (from requests) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\venka\anaconda3\lib\site-packages (from requests) (2025.11.12)
Note: you may need to restart the kernel to use updated packages.

In [110]:
web_df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [1]:
# Reading HTML page using read_html
# headers fetch html page using requests with User-Agent, then parse

import pandas as pd
import requests

url = "https://en.wikipedia.org/wiki/Mobile_country_code"

headers = {"User-Agent": "Mozilla/5.0"}

html = requests.get(url, headers=headers).text
df = pd.read_html(html, match="Country", header=0)[0]

df.head()

C:\Users\venka\AppData\Local\Temp\ipykernel_10820\414681288.py:12: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df = pd.read_html(html, match="Country", header=0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN

In [4]:
# Reading Excel file 

excel_df=pd.read_excel("sample_excel.xlsx")
excel_df.head()

     Name  Age
0   Peter   40
1     Sha   45
2    Modi   65
3  Donald   80

In [3]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\venka\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\venka\anaconda3\lib\site-packages (from openpyxl) (2.0.0)

### Pickle file
#### Pickle in Python is primary used in serializing and deserializing a Python object structure. In other words, its the process of converting a Python object into a byte stream to store it in a file/database, maintain program state across sessions, or transport data over the newtowrk

In [5]:
# Converting Pickle file 

excel_df.to_pickle('mypicklefile')

In [6]:
# Reading pickle file 

pd.read_pickle('mypicklefile')

     Name  Age
0   Peter   40
1     Sha   45
2    Modi   65
3  Donald   80